src/Documents/Scan_ЗаявкаНаСервисныеРаботы/Scan_ЗаявкаНаСервисныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаСервисныеРаботы</name>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <basedOn>Document.Scan_ЗаявкаПеревозчику</basedOn>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПодтвержденнаяИсполнителем</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведенияРабот</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиВ1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>КодДефекта</name>
      <type>
        <types>CatalogRef.Scan_КодыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Scan_ВидыСервисныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Тахограф</name>
      <type>
        <types>CatalogRef.Scan_ВидыТахографов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОбращенияНаСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказНаряда</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZNN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ВыполненныеРаботыНаИзделиях/Scan_ВыполненныеРаботыНаИзделиях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВыполненныеРаботыНаИзделиях</name>
  <resources>
    <name>СуммаРаботБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРаботНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПодтвержденнаяИсполнителем</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодтвержденИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаОбращенияНаСервис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тахограф</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказНаряда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Scan_ВидыСервисныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаСервисныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНеисправнойДетали</name>
    <type>
      <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДефекта</name>
    <type>
      <types>CatalogRef.Scan_КодыДефектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующие</name>
    <type>
      <types>CatalogRef.Scan_Комплектующие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ОтправленныеПисьма/Scan_ОтправленныеПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ОтправленныеПисьма</name>
  <resources>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Копии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Кому</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтправки</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЧекЛистТехническогоСостоянияИзделия</types>
      <types>DocumentRef.Scan_ЗаявкаНаСервисныеРаботы</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_СтатусыЗаявокНаРаботы/Scan_СтатусыЗаявокНаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаРаботы</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
    <items>
      <name>Рассмотрена</name>
      <description>Рассмотрена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Scan_ЗаявкаНаСервисныеРаботы/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда
	
		ДокументОснование = ДанныеЗаполнения;
	//
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_ЗаявкаПеревозчику") Тогда
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// При подчинении регистратору
	//// регистр Scan_ВыполненныеРаботыНаИзделиях
	//Движения.Scan_ВыполненныеРаботыНаИзделиях.Записывать = Истина;
	//Для Каждого ТекСтрокаСоставЗаявки Из СоставЗаявки Цикл
	//	Движение = Движения.Scan_ВыполненныеРаботыНаИзделиях.Добавить();
	//	Движение.Изделие = ТекСтрокаСоставЗаявки.Изделие;
	//	Движение.Работа = ТекСтрокаСоставЗаявки.Работа;
	//	Движение.Документ = Ссылка;
	//	Движение.СуммаРаботБезНДС = ТекСтрокаСоставЗаявки.СуммаРаботБезНДС;
	//	Движение.СуммаРаботНДС = ТекСтрокаСоставЗаявки.СуммаРаботНДС;
	//	Движение.Исполнитель = Исполнитель;
	//	Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//	Движение.ПлановаяДатаВыполнения = ПлановаяДатаВыполнения;
	//	Движение.ПлановаяДатаПодтвержденнаяИсполнителем = ПлановаяДатаПодтвержденнаяИсполнителем;
	//	Движение.ПодтвержденИсполнителем = ПодтвержденоИсполнителем;
	//КонецЦикла;
	
	// Независимый регистр
	// регистр Scan_ВыполненныеРаботыНаИзделиях
	НаборЗаписей = РегистрыСведений.Scan_ВыполненныеРаботыНаИзделиях.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Очистить();
	Если Не Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Аннулирована Тогда
	
		Для Каждого ТекСтрокаСоставЗаявки Из СоставЗаявки Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Изделие = ТекСтрокаСоставЗаявки.Изделие;
			Движение.Работа = ТекСтрокаСоставЗаявки.Работа;
			// rarus tenkam 22.03.2018 mantis 9428 +++
			Движение.КодНеисправнойДетали = ТекСтрокаСоставЗаявки.КодНеисправнойДетали;
			Движение.КодДефекта = ТекСтрокаСоставЗаявки.КодДефекта;
			Движение.Комплектующие = ТекСтрокаСоставЗаявки.Комплектующие;
			Движение.Количество = ТекСтрокаСоставЗаявки.Количество;
			Движение.Комментарий = ТекСтрокаСоставЗаявки.Комментарий;
			Движение.ПричинаОбращенияНаСервис = ТекСтрокаСоставЗаявки.ПричинаОбращенияНаСервис;
			Движение.Тахограф = ТекСтрокаСоставЗаявки.Тахограф;
			// rarus tenkam 22.03.2018 mantis 9428 ---    			
			Движение.Документ = Ссылка;
			Движение.СуммаРаботБезНДС = ТекСтрокаСоставЗаявки.СуммаРаботБезНДС;
			Движение.СуммаРаботНДС = ТекСтрокаСоставЗаявки.СуммаРаботНДС;
			Движение.ЗаказНаряд = ТекСтрокаСоставЗаявки.ЗаказНаряд;
			Движение.ДатаЗаказНаряда = ТекСтрокаСоставЗаявки.ДатаЗаказНаряда;
			Движение.ФактическаяДатаВыполнения = ТекСтрокаСоставЗаявки.ДатаЗаказНаряда;
			Движение.Исполнитель = Исполнитель;
			//rarus FominskiyAS 28.02.2019  mantis 13863 +++
			//Движение.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			Движение.Пользователь = ПользователиСлужебный.АвторизованныйПользователь();
			//rarus FominskiyAS 28.02.2019  mantis 13863 ---
			Движение.ПлановаяДатаВыполнения = ПлановаяДатаВыполнения;
			Движение.ПлановаяДатаПодтвержденнаяИсполнителем = ПлановаяДатаПодтвержденнаяИсполнителем;
			Движение.ПодтвержденИсполнителем = ПодтвержденоИсполнителем;
		КонецЦикла;		
	
	КонецЕсли;
	Попытка		//rarus tenkam 12.02.2018 mantis 9428 +
		НаборЗаписей.Записать(Истина);
	//rarus tenkam 12.02.2018 mantis 9428 +++
	Исключение
		Отказ = Истина;
		Сообщить("Не удалось записать данные регистра. " + ОписаниеОшибки());
	КонецПопытки;
	//rarus tenkam 12.02.2018 mantis 9428 ---
	
КонецПроцедуры

Процедура УстановитьСтатус()

	Если Не ЗначениеЗаполнено(Статус) Тогда
	
		Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Новая;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель)
		И ЗначениеЗаполнено(ПлановаяДатаВыполнения)
			И ЕстьОтправленныеПисьма(Ссылка)
				 И Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Новая Тогда
	
		Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Рассмотрена;
	
	КонецЕсли;
	
	Если ПодтвержденоИсполнителем 
		И ЗначениеЗаполнено(ПлановаяДатаПодтвержденнаяИсполнителем)		//rarus tenkam 06.02.2018 mantis 9428 + bug
				 И Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Рассмотрена Тогда
	
		Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Подтверждена;
	
	КонецЕсли;
	
	Если (Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Подтверждена 
			Или Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.ВРаботе)
				И СоставЗаявкиЗаполнен(СоставЗаявки) Тогда
	
		Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Исполнена;
	
	КонецЕсли;
	

КонецПроцедуры

Функция СоставЗаявкиЗаполнен(Знач ТЧ_СоставЗаявки)

	ТЧ_СоставЗаявки = СоставЗаявки.Выгрузить();
	
	Для каждого Строка Из ТЧ_СоставЗаявки Цикл
	
		Если Не ЗначениеЗаполнено(Строка.ДатаЗаказНаряда)
			Или Не ЗначениеЗаполнено(Строка.ЗаказНаряд)
				Или Не ЗначениеЗаполнено(Строка.СуммаРаботБезНДС)
					//Или Не ЗначениеЗаполнено(Строка.СуммаРаботНДС) 
					Тогда
		
			Возврат Ложь;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	//// rarus tenkam 13.02.2018 mantis 9428 +++
	//ТЧ_КомплектующиеЗаявки = КомплектующиеЗаявки.Выгрузить();
	//
	//Для каждого Строка Из ТЧ_КомплектующиеЗаявки Цикл		
	//	Если Не ЗначениеЗаполнено(Строка.ДатаЗаказНаряда)
	//		Или Не ЗначениеЗаполнено(Строка.ЗаказНаряд)
	//		Или Не ЗначениеЗаполнено(Строка.СуммаРаботБезНДС) 
	//		Тогда
	//		
	//		Возврат Ложь;	
	//		
	//	КонецЕсли;			
	//КонецЦикла;
	//// rarus tenkam 13.02.2018 mantis 9429 ---
	
	Возврат Истина;

КонецФункции // ()

Функция ЕстьОтправленныеПисьма(ЗаявкаНаСервисныеРаботы)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ОтправленныеПисьма.Кому КАК Кому,
	               |	Scan_ОтправленныеПисьма.ДатаОтправки КАК ДатаОтправки,
	               |	Scan_ОтправленныеПисьма.ДокументОтправки КАК ДокументОтправки
	               |ИЗ
	               |	РегистрСведений.Scan_ОтправленныеПисьма КАК Scan_ОтправленныеПисьма
	               |ГДЕ
	               |	Scan_ОтправленныеПисьма.ДокументОтправки = &ДокументОтправки";
	
	Запрос.УстановитьПараметр("ДокументОтправки", ЗаявкаНаСервисныеРаботы);

	Результат = Запрос.Выполнить();
	
	РезультатПустой = Результат.Пустой();
	
	Возврат Не РезультатПустой;
	
КонецФункции // ()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПодтвержденоИсполнителем 
		И (Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.Новая) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установка флага ""Подтверждено исполнителем"" возможна только в статусе ""Рассмотрена""!";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		УстановитьСтатус(); 		
	
	КонецЕсли;
	
	// rarus tenkam 13.02.2018 mantis 9428 +++ bug
	Если Не ЗначениеЗаполнено(НомерДокументаВнутренний) Тогда	
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			УстановитьНовыйНомер();				 
		КонецЕсли;
		НомерДокументаВнутренний = Строка(Номер) + "-" + 1;
	КонецЕсли;
	// rarus tenkam 13.02.2018 mantis 9428 --- bug  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		ПроверитьЗаполненностьРабот(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьРабот(Отказ)

	Для каждого СтрокаИзделия Из СоставЗаявки Цикл
	
		Если Не ЗначениеЗаполнено(СтрокаИзделия.Работа) Тогда
		
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена работа в строке № " + СтрокаИзделия.НомерСтроки;
			Сообщение.Сообщить();
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = 0;
	НомерДокументаВнутренний = "";		//rarus tenkam 13.02.2018 mantis 9428 + bug
	
КонецПроцедуры
